Revit 2022 API
AnalyticalModelSketchComponent Properties
The AnalyticalModelSketchComponent type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace